.doom.d/doom-config.org
* INTRODUCTION
Đây là cấu hình cho doom emacs của tôi.
* ORG FACES
Setup face for org mode

#+begin_src emacs-lisp :results none
(defun dk/org-mode-setup()
  (text-scale-set 3)
)

(use-package! org
  :hook (org-mode . dk/org-mode-setup)
  :config
  (setq org-ellipsis " ▾")
  (setq org-superstar-headline-bullets-list '("◉" "○" "●" "○" "●" "○" "●"))

  (set-face-attribute 'org-level-1 nil :font "Cantarell" :weight 'regular :height 1.3)
  (set-face-attribute 'org-level-2 nil :font "Cantarell" :weight 'regular :height 1.2)
  (set-face-attribute 'org-level-3 nil :font "Cantarell" :weight 'regular :height 1.1)
)
; màu vàng :foreground "#ffad29"
#+end_src

#+RESULTS:
: #<buffer doom-config.org>


* ORG BABEL
** Add org tempo to support source code block
#+begin_src emacs-lisp
(use-package! org-tempo
  :config
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp")))
#+end_src

** F5 to excute code block
#+begin_src emacs-lisp :results silent
(map! "<f5>" (lambda() (interactive) (org-babel-execute-src-block)))
#+end_src

* ORG ROARM

#+begin_src emacs-lisp :results silent :tangle khanh-pkg.el
(package! org-roam)
#+end_src

#+RESULT:
: #<buffer doom-config.org>

#+begin_src emacs-lisp :result silent
(use-package! org-roam
  :ensure t
  :custom
  (org-roam-directory "~/Dropbox/RoamNotes")
  (org-roam-completion-everywhere t)
  :bind (("C-c n l" . org-roam-buffer-toggle)
         ("C-c n f" . org-roam-node-find)
         ("C-c n i" . org-roam-node-insert)
         :map org-mode-map
         ("C-M-i" . completion-at-point)
         :map org-roam-dailies-map
         ("Y" . org-roam-dailies-capture-yesterday)
         ("T" . org-roam-dailies-capture-tomorrow))
  :bind-keymap
  ("C-c n d" . org-roam-dailies-map)
  :config
  (require 'org-roam-dailies) ;; Ensure the keymap is available
  (org-roam-db-autosync-mode))
#+end_src

#+RESULTS:
: #<buffer doom-config.org>
* ORG EXPORT PDF
#+begin_src emacs-lisp
(setenv "PATH"
        (concat "/Library/TeX/texbin" ":"
                (getenv "PATH")))

(setq org-latex-compiler "xelatex")

(setq org-latex-to-pdf-process
  '("xelatex -interaction nonstopmode %f"
     "xelatex -interaction nonstopmode %f"))

#+end_src

#+RESULTS:
: #<buffer doom-config.org>
* ISSUES

** Fix issue for metakey only on Doom Emacs
MacOS when use bluetooth device map meta key error. Need deploy code to fix it.

#+begin_src emacs-lisp
(setq mac-right-option-modifier 'meta)
#+end_src

#+RESULTS:
: super
